import course1 from "../assets/images/courses/course1.png";
import course2 from "../assets/images/courses/course2.png";
import course3 from "../assets/images/courses/course3.png";
import course4 from "../assets/images/courses/course4.png";
import course5 from "../assets/images/courses/course5.png";
import course6 from "../assets/images/courses/course6.png";
import course7 from "../assets/images/courses/course7.png";
import course8 from "../assets/images/courses/course8.png";
import course9 from "../assets/images/courses/course9.png";
import course10 from "../assets/images/courses/course10.png";
import course11 from "../assets/images/courses/course11.png";
import course12 from "../assets/images/courses/course12.png";

export const coursesData = [
  {
    id: 1,
    name: "คอร์สใหม่",
    courses: [
      {
        id: 1,
        title: "การประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์",
        image: course1,
        genre: "ศิลปะและการพัฒนาตนเอง",
        detail:
          "รายวิชาการประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์ จะเป็นการนำเสนอเนื้อหาเกี่ยวกับการประชาสัมพันธ์ผ่านสื่อวิทยุ และสื่อโทรทัศน์  โดยผู้สอนจะกล่าวถึงความรู้พื้นฐาน  ประวัติความเป็นมา ประเภทของรายการวิทยุ และโทรทัศน์  รูปแบบการประชาสัมพันธ์  วิธีการเขียนบทวิทยุ และการเขียนบทโทรทัศน์  พร้อมทั้งนำเสนอเทคนิคการผลิตสื่อประชาสัมพันธ์  นักประชาสัมพันธ์ที่ดีจะต้องรู้จักพัฒนากลยุทธ์การประชาสัมพันธ์ให้สอดคล้องกับสิ่งที่องค์กรต้องการ และเผยแพร่สื่อที่ดีเพื่อให้สื่อสามารถเข้าถึงมวลชนได้ตรงตามวัตถุประสงค์",
        availableSeat: 25,
        totalSeat: 50,
      },
      {
        id: 2,
        title: "การงบประมาณภาครัฐ",
        image: course2,
        genre: "การจัดการ",
        detail:
          "วิชาการงบประมาณภาครัฐ  เนื้อหาวิชาจะนำเสนอเกี่ยวกับกาวางแผนงบประมาณ การให้ความเห็นชอบ การนำแผนไปปฏิบัติ การบริหารแผนงบประมาณ และการติดตามประเมินผล บทเรียนทั้ง 5 ตอน จัดทำขึ้นเพื่อให้ผู้เรียนได้เข้าใจบทบาท หน้าที่ ของผู้บริหาร และผู้ปฏิบัติงานในภาครัฐในกระบวนการการงบประมาณ และสามารถนำไปปรับใช้กับหน่วยงานตนเอง เพื่อให้การดำเนินงานด้านการงบประมาณมีประสิทธิภาพมากยิ่งขึ้น",
        availableSeat: 3000,
        totalSeat: 4000,
      },
      {
        id: 3,
        title: "มหากาพย์ สังคมศึกษา น่ารู้: ภูมิศาสตร์",
        image: course3,
        genre: "ศิลปะและการพัฒนาตนเอง",
        detail:
          "สำหรับคอร์สวิชานี้จะมีชื่อว่า มหากาพย์ สังคมศึกษา น่ารู้ โดยจะมีทั้งหมด 5 เรื่อง ได้แก่ กฎหมายและสังคมวิทยา ศาสนาสากลและพระพุทธศาสนา เศรษฐศาสตร์ ภูมิศาสตร์ และประวัติศาสตร์ วิชานี้จะเป็นเป็นการนำเสนอความรู้เรื่องสังคมศึกษาที่จำเป็นต่อนักเรียน นิสิต นักศึกษา และประชาชนทั่วไป ผู้เรียนสามารถนำความรู้ที่ได้ไปใช้กับการสอบเข้าศึกษาต่อในมหาวิทยาลัย และนำไปใช้ในชีวิตประจำวัน",
        availableSeat: 1250,
        totalSeat: 5000,
      },
      {
        id: 4,
        title: "อาหารสุขภาพ รู้ทัน รู้จริง",
        image: course4,
        genre: "สุขภาพ",
        detail:
          "วิชาอาหารสุขภาพ รู้ทัน รู้จริง จะมีเนื้อหาเกี่ยวกับการดูแลตนเองให้มีสุขภาพดีห่างไกลจากโรค ด้วยข้อแนะนำการกินอาหารที่ถูกต้อง  สำหรับกรใช้ชีวิตในสังคมยุคดิจิทัล และสื่อโซเชียลที่มีการเผยแพร่ข้อมูลข่าวสารมากมาย ทำอย่างไรจึงจะรู้เท่าทัน  ทำอย่างไรจึงจะไม่ตกเป็นเหยื่อ  ข่าวลวงมากมายที่ทำให้ผู้คนไขว้เขว สับสน กับข้อมูลอาหารที่ทำให้มีสุขภาพดี ซึ่งนำไปสู่การแชร์จนมีการปฏิบัติตาม และสามารถนำไปสู่ผลเสียต่อสุขภาพได้",
        availableSeat: 2500,
        totalSeat: 8000,
      },
      {
        id: 5,
        title: "ประกันสังคมนั้นสำคัญไฉน (Why Social Security is Vital to Us.)",
        image: course5,
        genre: "ศิลปะและการพัฒนาตนเอง",
        detail:
          "วิชาประกันสังคมนั้นสำคัญไฉน (Why Social Security is Vital to Us.)  เป็นวิชาที่จุฬาลงกรณ์มหาวิทยาลัยได้ร่วมกับสำนักงานประกันสังคม เพื่อให้ผู้เรียนเข้าใจภาพรวมเกี่ยวกับเรื่องการประกันตนเองที่จะได้รับจากกองทุนประกันสังคม  โดยจะกล่าวถึง ประวัติความเป็นมา หลักการ แนวความคิดการประกันสังคม รวมถึงการได้รับสิทธิประโยชน์ของผู้ประกันตนตามแต่ละมาตราอย่างละเอียด เพื่อให้ลูกจ้าง นายจ้าง และผู้ประกอบอาชีพอิสระ นำความรู้ที่ได้ไปใช้ประโยชน์แก่ตนเองได้อย่างเหมาะสม",
        availableSeat: 3888,
        totalSeat: 4888,
      },
    ],
  },
  {
    id: 2,
    name: "ลงได้ทั้งปี",
    courses: [
      {
        id: 6,
        title: "การพัฒนาทักษะชีวิต",
        image: course6,
        genre: "ศิลปะและการพัฒนาตนเอง",
        detail:
          "วิชาการพัฒนาทักษะชีวิต จะมีเนื้อหาเพื่อส่งเสริมกิจกรรมการเรียนรู้ตลอดชีวิตของผู้บริหาร คณาจารย์ บุคลากรทางการศึกษา ตลอดจนประชาชนทั่วไปที่มีความสนใจพัฒนาตนเองในด้าน ทักษะชีวิต ผ่านการสื่อสารภายในตนเองและการแนะแนว สำหรับเนื้อหาทั้งหมด ประกอบด้วย 3 ส่วน คือ การสื่อสารภายในตนเอง การแนะแนวเบื้องต้น และการทำสมุดแปลนชีวิต",
      },
      {
        id: 7,
        title: "ก่อนจะมาเป็นยา: การทดลองทางเภสัชจลนศาสตร์พรีคลินิก",
        image: course7,
        genre: "สุขภาพ",
        detail:
          "วิชา ก่อนมาจะเป็นยา: การทดลองทางเภสัชจลนศาสตร์พรีคลินิก จะมีเนื้อหาเกี่ยวกับการความรู้เรื่องกระบวนการทดลองทางเภสัชจลนศาสตร์พรีคลินิก จะเป็นการนำเสนอกระบวนการพัฒนายา การเตรียมยาสำหรับสัตว์ทดลอง การออกแบบกระบวนการทดลอง เช่น การคัดเลือกสัตว์ทดลองที่เหมาะสม การเก็บตัวอย่าง การวิเคราะห์ตัวอย่าง  รวมไปถึงการวิเคราะห์ผลการทดลอง เพื่อให้การคำนวณหาค่าและการนำไปใช้ได้อย่างมีประสิทธิภาพ",
      },
      {
        id: 8,
        title: "คณิตศาสตร์การเงินในชีวิตประจำวัน",
        image: course8,
        genre: "การจัดการ",
        detail:
          "วิชาคณิตศาสตร์การเงินในชีวิตประจำวัน จะมีเนื้อหาเกี่ยวกับการนำสื่อความรู้พื้นฐานทางคณิตศาสตร์ง่าย ๆ ที่เกี่ยวข้องกับชีวิตประจำวันของผู้เรียน เป็นการประยุกต์ใช้คณิตศาสตร์เข้ากับ 2 เรื่องได้แก่ บัตรเครดิต การคิดดอกเบี้ยบัตรเครดิต การคิดดอกเบี้ยจากการกดเงินสดจากบัตรเครดิต และการเสียภาษีเงินได้บุคคลธรรม",
      },
      {
        id: 9,
        title: "เรื่องสิ่งแวดล้อมเรื่องของเรา: What (Love) is in the air?",
        image: course9,
        genre: "เทคโนโลยี",
        detail:
          "รายวิชาเรื่องสิ่งแวดล้อมเรื่องของเรา: what (Love) is in the air? จะมีเนื้อหาเกี่ยวกับการเผยแพร่ความรู้เรื่อง สิ่งแวดล้อมเป็นเรื่องสำคัญเพราะปัจจุบันสภาพภูมิอากาศของโลกได้มีการเปลี่ยนแปลงไปในทางที่ร้ายแรงขึ้นทำให้เกิดปรากฎการณ์ที่แปลกประหลาดมากมาย ไม่ว่าจะเป็นอากาศที่ร้อนขึ้น ฝนไม่ตกเกิดภาวะน้ำแห้งแล้ง และที่เห็นได้ชัดที่สุดคือเมื่อต้นปีที่ผ่านมาประเทศไทยก็ประสบกับปัญหาเกี่ยวกับฝุ่น PM2.5 ซึ่งทำให้ประชาชนคนไทยทุกคนได้รับผลกระทบโดยตรงทำให้รัฐบาลต้องประกาศหยุดเรียน  สำหรับเนื้อหาวิชานี้จะกล่าวถึงความเชื่อมโยงของสภาพภูมิอากาศที่เปลี่ยนแปลงไป ภาวะโลกร้อน และมลพิษทางอากาศ เพื่อสร้างความเข้าใจและตระหนักถึงความสำคัญของสภาพแวดล้อมตลอดจนแนวทางการมีส่วนร่วมในการจัดการเพื่อสิ่งแวดล้อมที่ดีขึ้น",
      },
      {
        id: 10,
        title: "พลศาสตร์กระบวนการและการควบคุม",
        image: course10,
        genre: "เทคโนโลยี",
        detail:
          "พลศาสตร์กระบวนการและการควบคุม :Process Dynamics & Control เนื้อหาจะเป็นการสร้างและใช้แบบจำลองคณิตศาสตร์มาอธิบายพฤติกรรมกระบวนการในอุตสาหกรรมเคมี และนำข้อมูลพฤติกรรมของกระบวนการเหล่านั้นไปใช้ในการออกแบบระบบควบคุมกระบวนการนั้นๆ เพื่อให้ตอบสนองตามเป้าหมายที่กำหนดไว้ โดยมีวัตถุประสงค์เพื่อต้องการให้นิสิตและผู้เรียนสามารถสร้างแบบจำลองคณิตศาสตร์และสร้างระบบควบคุมอย่างง่ายได้อย่างมีประสิทธิภาพ",
      },
      {
        id: 11,
        title: "การตลาดในศตวรรษที่ 21",
        image: course11,
        genre: "การจัดการ",
        detail:
          "รายวิชาการตลาดในศตวรรษที่ 21 จะเป็นการศึกษาเกี่ยวกับนิยามของการตลาด แนวคิดหลักเกี่ยวกับการตลาดตั้งแต่อดีตจนถึงปัจจุบัน และการตลาดแบบองค์รวม (Holistic Marketing) ซึ่งเป็นสิ่งที่สำคัญสำหรับการตลาดในศตวรรษที่ 21",
      },
      {
        id: 12,
        title: "มหากาพย์ สังคมศึกษา น่ารู้ : ประวัติศาสตร์",
        image: course12,
        genre: "ศิลปะและการพัฒนาตนเอง",
        detail:
          "สำหรับคอร์สวิชานี้จะมีชื่อว่า มหากาพย์ สังคมศึกษา น่ารู้ โดยจะมีทั้งหมด 5 เรื่อง ได้แก่ กฎหมายและสังคมวิทยา   ศาสนาสากลและพระพุทธศาสนา   เศรษฐศาสตร์   ภูมิศาสตร์  และประวัติศาสตร์   วิชานี้จะเป็นเป็นการนำเสนอความรู้เรื่องสังคมศึกษาที่จำเป็นต่อนักเรียน นิสิต นักศึกษา และประชาชนทั่วไป  ผู้เรียนสามารถนำความรู้ที่ได้ไปใช้กับการสอบเข้าศึกษาต่อในมหาวิทยาลัย และนำไปใช้ในชีวิตประจำวัน",
      },
    ],
  },
];

export const courses = [
  {
    id: 1,
    title: "การประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์",
    image: course1,
    genre: "ศิลปะและการพัฒนาตนเอง",
    detail:
      "รายวิชาการประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์ จะเป็นการนำเสนอเนื้อหาเกี่ยวกับการประชาสัมพันธ์ผ่านสื่อวิทยุ และสื่อโทรทัศน์  โดยผู้สอนจะกล่าวถึงความรู้พื้นฐาน  ประวัติความเป็นมา ประเภทของรายการวิทยุ และโทรทัศน์  รูปแบบการประชาสัมพันธ์  วิธีการเขียนบทวิทยุ และการเขียนบทโทรทัศน์  พร้อมทั้งนำเสนอเทคนิคการผลิตสื่อประชาสัมพันธ์  นักประชาสัมพันธ์ที่ดีจะต้องรู้จักพัฒนากลยุทธ์การประชาสัมพันธ์ให้สอดคล้องกับสิ่งที่องค์กรต้องการ และเผยแพร่สื่อที่ดีเพื่อให้สื่อสามารถเข้าถึงมวลชนได้ตรงตามวัตถุประสงค์",
    availableSeat: 25,
    totalSeat: 50,
  },
  {
    id: 2,
    title: "การงบประมาณภาครัฐ",
    image: course2,
    genre: "การจัดการ",
    detail:
      "วิชาการงบประมาณภาครัฐ  เนื้อหาวิชาจะนำเสนอเกี่ยวกับกาวางแผนงบประมาณ การให้ความเห็นชอบ การนำแผนไปปฏิบัติ การบริหารแผนงบประมาณ และการติดตามประเมินผล บทเรียนทั้ง 5 ตอน จัดทำขึ้นเพื่อให้ผู้เรียนได้เข้าใจบทบาท หน้าที่ ของผู้บริหาร และผู้ปฏิบัติงานในภาครัฐในกระบวนการการงบประมาณ และสามารถนำไปปรับใช้กับหน่วยงานตนเอง เพื่อให้การดำเนินงานด้านการงบประมาณมีประสิทธิภาพมากยิ่งขึ้น",
    availableSeat: 3000,
    totalSeat: 4000,
  },
  {
    id: 3,
    title: "มหากาพย์ สังคมศึกษา น่ารู้: ภูมิศาสตร์",
    image: course3,
    genre: "ศิลปะและการพัฒนาตนเอง",
    detail:
      "สำหรับคอร์สวิชานี้จะมีชื่อว่า มหากาพย์ สังคมศึกษา น่ารู้ โดยจะมีทั้งหมด 5 เรื่อง ได้แก่ กฎหมายและสังคมวิทยา ศาสนาสากลและพระพุทธศาสนา เศรษฐศาสตร์ ภูมิศาสตร์ และประวัติศาสตร์ วิชานี้จะเป็นเป็นการนำเสนอความรู้เรื่องสังคมศึกษาที่จำเป็นต่อนักเรียน นิสิต นักศึกษา และประชาชนทั่วไป ผู้เรียนสามารถนำความรู้ที่ได้ไปใช้กับการสอบเข้าศึกษาต่อในมหาวิทยาลัย และนำไปใช้ในชีวิตประจำวัน",
    availableSeat: 1250,
    totalSeat: 5000,
  },
  {
    id: 4,
    title: "อาหารสุขภาพ รู้ทัน รู้จริง",
    image: course4,
    genre: "สุขภาพ",
    detail:
      "วิชาอาหารสุขภาพ รู้ทัน รู้จริง จะมีเนื้อหาเกี่ยวกับการดูแลตนเองให้มีสุขภาพดีห่างไกลจากโรค ด้วยข้อแนะนำการกินอาหารที่ถูกต้อง  สำหรับกรใช้ชีวิตในสังคมยุคดิจิทัล และสื่อโซเชียลที่มีการเผยแพร่ข้อมูลข่าวสารมากมาย ทำอย่างไรจึงจะรู้เท่าทัน  ทำอย่างไรจึงจะไม่ตกเป็นเหยื่อ  ข่าวลวงมากมายที่ทำให้ผู้คนไขว้เขว สับสน กับข้อมูลอาหารที่ทำให้มีสุขภาพดี ซึ่งนำไปสู่การแชร์จนมีการปฏิบัติตาม และสามารถนำไปสู่ผลเสียต่อสุขภาพได้",
    availableSeat: 2500,
    totalSeat: 8000,
  },
  {
    id: 5,
    title: "ประกันสังคมนั้นสำคัญไฉน (Why Social Security is Vital to Us.)",
    image: course5,
    genre: "ศิลปะและการพัฒนาตนเอง",
    detail:
      "วิชาประกันสังคมนั้นสำคัญไฉน (Why Social Security is Vital to Us.)  เป็นวิชาที่จุฬาลงกรณ์มหาวิทยาลัยได้ร่วมกับสำนักงานประกันสังคม เพื่อให้ผู้เรียนเข้าใจภาพรวมเกี่ยวกับเรื่องการประกันตนเองที่จะได้รับจากกองทุนประกันสังคม  โดยจะกล่าวถึง ประวัติความเป็นมา หลักการ แนวความคิดการประกันสังคม รวมถึงการได้รับสิทธิประโยชน์ของผู้ประกันตนตามแต่ละมาตราอย่างละเอียด เพื่อให้ลูกจ้าง นายจ้าง และผู้ประกอบอาชีพอิสระ นำความรู้ที่ได้ไปใช้ประโยชน์แก่ตนเองได้อย่างเหมาะสม",
    availableSeat: 3888,
    totalSeat: 4888,
  },
];

export const courses2 = [
  {
    id: 6,
    title: "การพัฒนาทักษะชีวิต",
    image: course6,
    genre: "ศิลปะและการพัฒนาตนเอง",
    detail:
      "วิชาการพัฒนาทักษะชีวิต จะมีเนื้อหาเพื่อส่งเสริมกิจกรรมการเรียนรู้ตลอดชีวิตของผู้บริหาร คณาจารย์ บุคลากรทางการศึกษา ตลอดจนประชาชนทั่วไปที่มีความสนใจพัฒนาตนเองในด้าน ทักษะชีวิต ผ่านการสื่อสารภายในตนเองและการแนะแนว สำหรับเนื้อหาทั้งหมด ประกอบด้วย 3 ส่วน คือ การสื่อสารภายในตนเอง การแนะแนวเบื้องต้น และการทำสมุดแปลนชีวิต",
  },
  {
    id: 7,
    title: "ก่อนจะมาเป็นยา: การทดลองทางเภสัชจลนศาสตร์พรีคลินิก",
    image: course7,
    genre: "สุขภาพ",
    detail:
      "วิชา ก่อนมาจะเป็นยา: การทดลองทางเภสัชจลนศาสตร์พรีคลินิก จะมีเนื้อหาเกี่ยวกับการความรู้เรื่องกระบวนการทดลองทางเภสัชจลนศาสตร์พรีคลินิก จะเป็นการนำเสนอกระบวนการพัฒนายา การเตรียมยาสำหรับสัตว์ทดลอง การออกแบบกระบวนการทดลอง เช่น การคัดเลือกสัตว์ทดลองที่เหมาะสม การเก็บตัวอย่าง การวิเคราะห์ตัวอย่าง  รวมไปถึงการวิเคราะห์ผลการทดลอง เพื่อให้การคำนวณหาค่าและการนำไปใช้ได้อย่างมีประสิทธิภาพ",
  },
  {
    id: 8,
    title: "คณิตศาสตร์การเงินในชีวิตประจำวัน",
    image: course8,
    genre: "การจัดการ",
    detail:
      "วิชาคณิตศาสตร์การเงินในชีวิตประจำวัน จะมีเนื้อหาเกี่ยวกับการนำสื่อความรู้พื้นฐานทางคณิตศาสตร์ง่าย ๆ ที่เกี่ยวข้องกับชีวิตประจำวันของผู้เรียน เป็นการประยุกต์ใช้คณิตศาสตร์เข้ากับ 2 เรื่องได้แก่ บัตรเครดิต การคิดดอกเบี้ยบัตรเครดิต การคิดดอกเบี้ยจากการกดเงินสดจากบัตรเครดิต และการเสียภาษีเงินได้บุคคลธรรม",
  },
  {
    id: 9,
    title: "เรื่องสิ่งแวดล้อมเรื่องของเรา: What (Love) is in the air?",
    image: course9,
    genre: "เทคโนโลยี",
    detail:
      "รายวิชาเรื่องสิ่งแวดล้อมเรื่องของเรา: what (Love) is in the air? จะมีเนื้อหาเกี่ยวกับการเผยแพร่ความรู้เรื่อง สิ่งแวดล้อมเป็นเรื่องสำคัญเพราะปัจจุบันสภาพภูมิอากาศของโลกได้มีการเปลี่ยนแปลงไปในทางที่ร้ายแรงขึ้นทำให้เกิดปรากฎการณ์ที่แปลกประหลาดมากมาย ไม่ว่าจะเป็นอากาศที่ร้อนขึ้น ฝนไม่ตกเกิดภาวะน้ำแห้งแล้ง และที่เห็นได้ชัดที่สุดคือเมื่อต้นปีที่ผ่านมาประเทศไทยก็ประสบกับปัญหาเกี่ยวกับฝุ่น PM2.5 ซึ่งทำให้ประชาชนคนไทยทุกคนได้รับผลกระทบโดยตรงทำให้รัฐบาลต้องประกาศหยุดเรียน  สำหรับเนื้อหาวิชานี้จะกล่าวถึงความเชื่อมโยงของสภาพภูมิอากาศที่เปลี่ยนแปลงไป ภาวะโลกร้อน และมลพิษทางอากาศ เพื่อสร้างความเข้าใจและตระหนักถึงความสำคัญของสภาพแวดล้อมตลอดจนแนวทางการมีส่วนร่วมในการจัดการเพื่อสิ่งแวดล้อมที่ดีขึ้น",
  },
  {
    id: 10,
    title: "พลศาสตร์กระบวนการและการควบคุม",
    image: course10,
    genre: "เทคโนโลยี",
    detail:
      "พลศาสตร์กระบวนการและการควบคุม :Process Dynamics & Control เนื้อหาจะเป็นการสร้างและใช้แบบจำลองคณิตศาสตร์มาอธิบายพฤติกรรมกระบวนการในอุตสาหกรรมเคมี และนำข้อมูลพฤติกรรมของกระบวนการเหล่านั้นไปใช้ในการออกแบบระบบควบคุมกระบวนการนั้นๆ เพื่อให้ตอบสนองตามเป้าหมายที่กำหนดไว้ โดยมีวัตถุประสงค์เพื่อต้องการให้นิสิตและผู้เรียนสามารถสร้างแบบจำลองคณิตศาสตร์และสร้างระบบควบคุมอย่างง่ายได้อย่างมีประสิทธิภาพ",
  },
  {
    id: 11,
    title: "การตลาดในศตวรรษที่ 21",
    image: course11,
    genre: "การจัดการ",
    detail:
      "รายวิชาการตลาดในศตวรรษที่ 21 จะเป็นการศึกษาเกี่ยวกับนิยามของการตลาด แนวคิดหลักเกี่ยวกับการตลาดตั้งแต่อดีตจนถึงปัจจุบัน และการตลาดแบบองค์รวม (Holistic Marketing) ซึ่งเป็นสิ่งที่สำคัญสำหรับการตลาดในศตวรรษที่ 21",
  },
  {
    id: 12,
    title: "มหากาพย์ สังคมศึกษา น่ารู้ : ประวัติศาสตร์",
    image: course12,
    genre: "ศิลปะและการพัฒนาตนเอง",
    detail:
      "สำหรับคอร์สวิชานี้จะมีชื่อว่า มหากาพย์ สังคมศึกษา น่ารู้ โดยจะมีทั้งหมด 5 เรื่อง ได้แก่ กฎหมายและสังคมวิทยา   ศาสนาสากลและพระพุทธศาสนา   เศรษฐศาสตร์   ภูมิศาสตร์  และประวัติศาสตร์   วิชานี้จะเป็นเป็นการนำเสนอความรู้เรื่องสังคมศึกษาที่จำเป็นต่อนักเรียน นิสิต นักศึกษา และประชาชนทั่วไป  ผู้เรียนสามารถนำความรู้ที่ได้ไปใช้กับการสอบเข้าศึกษาต่อในมหาวิทยาลัย และนำไปใช้ในชีวิตประจำวัน",
  },
];
