import course1 from "../assets/images/courses/course1.png";

import instructor1 from "../assets/images/instructors/instructor1.png";

export const MYCOURSES = [
  {
    id: 1,
    name: "ยอดนิยม",
    courses: [
      {
        id: 1,
        title: "การประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์",
        image: course1,
        genre: "ศิลปะและการพัฒนาตนเอง",
        instructor: {
          name: "รศ.ดร.สมิทธิ์ บุญชุติมา",
          description:
            "อาจารย์ประจำภาควิชาการประชาสัมพันธ์ คณะนิเทศศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย",
          image: instructor1,
        },
        round: {
          id: 2,
          duration:
            "เริ่มลงทะเบียน 9 ตุลาคม 2563<br/>เริ่มเรียนได้ 10 ตุลาคม 2563<br/>สิ้นสุดการเรียน 30 พฤศจิกายน 2563",
          unit: "2 บทเรียน",
          target: "นิสิต นักศึกษา และบุคคลทั่วไป<br/>จำนวน 5,000 คน",
          goal: "ผู้เรียนต้องทำคะแนนรวมทั้งหมด<br/>ให้ได้ร้อยละ 60 ขึ้นไป",
          platform: "OCSC Learning Platform",
        },
        detail:
          "รายวิชาการประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์ จะเป็นการนำเสนอเนื้อหาเกี่ยวกับการประชาสัมพันธ์ผ่านสื่อวิทยุ และสื่อโทรทัศน์  โดยผู้สอนจะกล่าวถึงความรู้พื้นฐาน  ประวัติความเป็นมา ประเภทของรายการวิทยุ และโทรทัศน์  รูปแบบการประชาสัมพันธ์  วิธีการเขียนบทวิทยุ และการเขียนบทโทรทัศน์  พร้อมทั้งนำเสนอเทคนิคการผลิตสื่อประชาสัมพันธ์  นักประชาสัมพันธ์ที่ดีจะต้องรู้จักพัฒนากลยุทธ์การประชาสัมพันธ์ให้สอดคล้องกับสิ่งที่องค์กรต้องการ และเผยแพร่สื่อที่ดีเพื่อให้สื่อสามารถเข้าถึงมวลชนได้ตรงตามวัตถุประสงค์",
        fineprint:
          "รายวิชาการใช้เครื่องมือสื่อสารผ่านวิทยุและโทรทัศน์ จะเป็นการนำเสนอเนื้อหาเกี่ยวกับการประชาสัมพันธ์ผ่านสื่อวิทยุ และสื่อโทรทัศน์ โดยผู้สอนจะกล่าวถึงความรู้พื้นฐาน ประวัติความเป็นมา ประเภทของรายการวิทยุ และโทรทัศน์ รูปแบบการประชาสัมพันธ์ วิธีการเขียนบทวิทยุ และการเขียนบทโทรทัศน์ พร้อมทั้งนำเสนอเทคนิคการผลิตสื่อประชาสัมพันธ์ นักประชาสัมพันธ์ที่ดีจะต้องรู้จักพัฒนากลยุทธ์การประชาสัมพันธ์ให้สอดคล้องกับสิ่งที่องค์กรต้องการ และเผยแพร่สื่อที่ดีเพื่อให้สื่อสามารถเข้าถึงมวลชนได้ตรงตามวัตถุประสงค์<br/><br/>เนื้อหาวิชา การประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์ ประกอบไปด้วย<br/><br/><b>บทที่ 1: PR in Radio Broadcasting</b><br/><ol><li>ความรู้พื้นฐานทางวิทยุกระจายเสียง<li>ประเภทรายการวิทยุกระจายเสียงและความสำคัญต่อการประชาสัมพันธ์<li>ประเภทของประชาสัมพันธ์ผ่านสื่อวิทยุกระจายเสียง<li>การเขียนบทวิทยุเพื่อการประชาสัมพันธ์<li>เทคนิคการผลิตสื่อประชาสัมพันธ์แบบโฆษณาทางวิทยุ</ol><br/><b>บทที่ 2: PR in Television Broadcasting</b><br/><ol><li>ความเป็นมาของสื่อวิทยุโทรทัศน์<li>ประเภทของระบบวิทยุโทรทัศน์<li>ประเภทของรายการวิทยุโทรทัศน์<li>รูปแบบการประชาสัมพันธ์ผ่านสื่อวิทยุโทรทัศน์<li>การผลิตสื่อประชาสัมพันธ์ทางโทรทัศน์<li>การเขียนบทโทรทัศน์เพื่อการประชาสัมพันธ์ ตอนที่ 1 <li>การเขียนบทโทรทัศน์เพื่อการประชาสัมพันธ์ ตอนที่ 2<li>ตัวอย่างการเขียนบทประชาสัมพันธ์ทางโทรทัศน์ ตอนที่ 1<li>ตัวอย่างการเขียนบทประชาสัมพันธ์ทางโทรทัศน์ ตอนที่ 2<li>รู้ทันสื่อโทรทัศน์ก่อนเลือกใช้</ol>",
        objective:
          "<ol><li>เพื่อให้ผู้เรียนได้ทราบแนวคิดและแนวทางการทำงานประชาสัมพันธ์ผ่านสื่อวิทยุกระจายเสียง และสื่อวิทยุโทรทัศน์<li>เพื่อให้ผู้เรียนมีความเข้าใจด้านแนวคิดของการใช้สื่อวิทยุกระจายเสียง และสื่อวิทยุโทรทัศน์ โดยสามารถนำไปใช้ให้เกิดประสิทธิภาพสูงสุด</ol>",
        criteria:
          "มีการวัดและประเมินผลผ่านแบบทดสอบย่อย (Quiz) และแบบทดสอบหลังเรียน (Posttest) โดยจะแบ่งเป็นคะแนนจาก Quiz เท่ากับ 50 คะแนน และคะแนนจาก Posttest เท่ากับ 50 คะแนน ทั้งนี้ผู้เรียนต้องทำคะแนนรวมทั้งหมดให้ได้ร้อยละ 60 ขึ้นไป และเรียนจบภายในเวลาที่กำหนดจึงจะสามารถขอรับ Certificate of Completion ได้",
        note:
          "<ol><li>ผู้เรียนจะมีสิทธิ์ทำแบบทดสอบหลังเรียน (Posttest) เมื่อเข้าร่วมกิจกรรมการเรียน (Course Progress) มากกว่า 80% ขึ้นไป<li>แบบทดสอบหลังเรียน (Posttest) ในแต่ละวิชาจะสามารถทำได้แค่ครั้งเดียวเท่านั้น</ol>",
        availableSeat: 1510,
        totalSeat: 5800,
      },
    ],
  },
];
